{
    "projectData": [
        {
            "type": "Ongoing Projects",
            "projects": [
                {
                    "name": "Rubik's Cube Solver", 
                    "description": "Implemented a Rubik's Cube Solving Algorithm applying Kociemba's Two-Step process. For implementation in Purdue ARC Club's Rubik's Cube Solver.", 
                    "tools": "C++",
                    "img": "",
                    "web_link": "",
                    "github_link": ""
                }
            ]
        },
        {
            "type": "Past Projects",
            "projects": [
                {
                    "name": "Memory Chess", 
                    "description": "Created a chess memory game to run on a Raspberry Pi handheld through the browser. Implemented my engine using WebAssembly within ReactJS", 
                    "tools": "C++, ReactJS, WebAssembly, Emscripten",
                    "img": "",
                    "web_link": "https://memory-chess.netlify.app/",
                    "github_link": "https://github.com/ArnavMeh/MemoryChess"
                },
                {
                    "name": "Chess Engine", 
                    "description": "Researched and implemented various algorithmic strategies, including bitwise representation and manipulation, alpha-beta pruning, move ordering, transposition tables, etc to create a chess engine. Additionally, I coded a Windows application memory game with the engine using wxWidgets", 
                    "tools": "C++, WxWidgets",
                    "img": "",
                    "web_link": "",
                    "github_link": "https://github.com/ArnavMeh/ArnavChess"
                },
                {
                    "name": "HSE Safety", 
                    "description": "Collaborated with school administration to plan and create a system for staff to quickly and securely access critical safety data. Involved creating a navigation system for a PDF, drill info extraction and room searching, and contact searching", 
                    "tools": "ReactJS, MongoDB, Express.Js, Node.Js, Ant Design, React-PDF",
                    "img": "",
                    "web_link": "",
                    "github_link": ""
                },
                {
                    "name": "HSE Courses", 
                    "description": "Developed a MERN web application to enhance students course planning, reduce course guide maintenance, and improve course offering and diploma requirement awareness. Students can search for courses with variety of feilds, add courses to a four-year plan, and see statistics on their selections whereas counselors can easily update diploma and course data and view student plans and notes", 
                    "tools": "ReactJS, MongoDB, Express.Js, Node.Js, Ant Design",
                    "img": "",
                    "web_link": "https://hsecourses.netlify.app/",
                    "github_link": ""
                }
            ]
        }
    ]
}